zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMcds_reg.h
/** \brief 8E8, Action Definition Register 26 */
#define MCDS_MCXACT26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108E8u)

/** \brief 8EC, Action Definition Register 27 */
#define MCDS_MCXACT27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108ECu)

/** \brief 8F0, Action Definition Register 28 */
#define MCDS_MCXACT28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108F0u)

/** \brief 8F4, Action Definition Register 29 */
#define MCDS_MCXACT29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108F4u)

/** \brief 8F8, Action Definition Register 30 */
#define MCDS_MCXACT30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108F8u)

/** \brief 8FC, Action Definition Register 31 */
#define MCDS_MCXACT31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA0108FCu)

/** \brief 900, Action Definition Register 32 */
#define MCDS_MCXACT32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010900u)

/** \brief 904, Action Definition Register 33 */
#define MCDS_MCXACT33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010904u)

/** \brief 908, Action Definition Register 34 */
#define MCDS_MCXACT34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010908u)

/** \brief 90C, Action Definition Register 35 */
#define MCDS_MCXACT35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01090Cu)

/** \brief 910, Action Definition Register 36 */
#define MCDS_MCXACT36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010910u)

/** \brief 914, Action Definition Register 37 */
#define MCDS_MCXACT37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010914u)

/** \brief 918, Action Definition Register 38 */
#define MCDS_MCXACT38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010918u)

/** \brief 91C, Action Definition Register 39 */
#define MCDS_MCXACT39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01091Cu)

/** \brief 920, Action Definition Register 40 */
#define MCDS_MCXACT40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010920u)

/** \brief 924, Action Definition Register 41 */
#define MCDS_MCXACT41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010924u)

/** \brief 928, Action Definition Register 42 */
#define MCDS_MCXACT42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010928u)

/** \brief 92C, Action Definition Register 43 */
#define MCDS_MCXACT43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01092Cu)

/** \brief 930, Action Definition Register 44 */
#define MCDS_MCXACT44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010930u)

/** \brief 934, Action Definition Register 45 */
#define MCDS_MCXACT45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010934u)

/** \brief 938, Action Definition Register 46 */
#define MCDS_MCXACT46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010938u)

/** \brief 93C, Action Definition Register 47 */
#define MCDS_MCXACT47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01093Cu)

/** \brief 940, Action Definition Register 48 */
#define MCDS_MCXACT48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010940u)

/** \brief 944, Action Definition Register 49 */
#define MCDS_MCXACT49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010944u)

/** \brief 948, Action Definition Register 50 */
#define MCDS_MCXACT50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010948u)

/** \brief 94C, Action Definition Register 51 */
#define MCDS_MCXACT51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01094Cu)

/** \brief 950, Action Definition Register 52 */
#define MCDS_MCXACT52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010950u)

/** \brief 954, Action Definition Register 53 */
#define MCDS_MCXACT53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010954u)

/** \brief 958, Action Definition Register 54 */
#define MCDS_MCXACT54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010958u)

/** \brief 95C, Action Definition Register 55 */
#define MCDS_MCXACT55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01095Cu)

/** \brief 960, Action Definition Register 56 */
#define MCDS_MCXACT56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010960u)

/** \brief 964, Action Definition Register 57 */
#define MCDS_MCXACT57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010964u)

/** \brief 968, Action Definition Register 58 */
#define MCDS_MCXACT58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010968u)

/** \brief 96C, Action Definition Register 59 */
#define MCDS_MCXACT59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01096Cu)

/** \brief 970, Action Definition Register 60 */
#define MCDS_MCXACT60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010970u)

/** \brief 974, Action Definition Register 61 */
#define MCDS_MCXACT61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010974u)

/** \brief 978, Action Definition Register 62 */
#define MCDS_MCXACT62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010978u)

/** \brief 97C, Action Definition Register 63 */
#define MCDS_MCXACT63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01097Cu)

/** \brief 980, Action Definition Register 64 */
#define MCDS_MCXACT64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010980u)

/** \brief 984, Action Definition Register 65 */
#define MCDS_MCXACT65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010984u)

/** \brief 988, Action Definition Register 66 */
#define MCDS_MCXACT66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010988u)

/** \brief 98C, Action Definition Register 67 */
#define MCDS_MCXACT67 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA01098Cu)

/** \brief 990, Action Definition Register 68 */
#define MCDS_MCXACT68 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010990u)

/** \brief 994, Action Definition Register 69 */
#define MCDS_MCXACT69 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010994u)

/** \brief 998, Action Definition Register 70 */
#define MCDS_MCXACT70 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCXACT*)0xFA010998u)

