zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMcds_reg.h
/** \brief AC4, Counter Limit Register */
#define MCDS_MCX12_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AC4u)
/** Alias (User Manual Name) for MCDS_MCX12_LMT.
* To use register names with standard convension, please use MCDS_MCX12_LMT.
*/
#define MCDS_MCXLMT12 (MCDS_MCX12_LMT)

/** \brief AC8, Current Count Register */
#define MCDS_MCX12_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AC8u)
/** Alias (User Manual Name) for MCDS_MCX12_CNT.
* To use register names with standard convension, please use MCDS_MCX12_CNT.
*/
#define MCDS_MCXCNT12 (MCDS_MCX12_CNT)

/** \brief AD0, Counter Control Register */
#define MCDS_MCX13_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AD0u)
/** Alias (User Manual Name) for MCDS_MCX13_CCL.
* To use register names with standard convension, please use MCDS_MCX13_CCL.
*/
#define MCDS_MCXCCL13 (MCDS_MCX13_CCL)

/** \brief AD4, Counter Limit Register */
#define MCDS_MCX13_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AD4u)
/** Alias (User Manual Name) for MCDS_MCX13_LMT.
* To use register names with standard convension, please use MCDS_MCX13_LMT.
*/
#define MCDS_MCXLMT13 (MCDS_MCX13_LMT)

/** \brief AD8, Current Count Register */
#define MCDS_MCX13_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AD8u)
/** Alias (User Manual Name) for MCDS_MCX13_CNT.
* To use register names with standard convension, please use MCDS_MCX13_CNT.
*/
#define MCDS_MCXCNT13 (MCDS_MCX13_CNT)

/** \brief AE0, Counter Control Register */
#define MCDS_MCX14_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AE0u)
/** Alias (User Manual Name) for MCDS_MCX14_CCL.
* To use register names with standard convension, please use MCDS_MCX14_CCL.
*/
#define MCDS_MCXCCL14 (MCDS_MCX14_CCL)

/** \brief AE4, Counter Limit Register */
#define MCDS_MCX14_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AE4u)
/** Alias (User Manual Name) for MCDS_MCX14_LMT.
* To use register names with standard convension, please use MCDS_MCX14_LMT.
*/
#define MCDS_MCXLMT14 (MCDS_MCX14_LMT)

/** \brief AE8, Current Count Register */
#define MCDS_MCX14_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AE8u)
/** Alias (User Manual Name) for MCDS_MCX14_CNT.
* To use register names with standard convension, please use MCDS_MCX14_CNT.
*/
#define MCDS_MCXCNT14 (MCDS_MCX14_CNT)

/** \brief AF0, Counter Control Register */
#define MCDS_MCX15_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010AF0u)
/** Alias (User Manual Name) for MCDS_MCX15_CCL.
* To use register names with standard convension, please use MCDS_MCX15_CCL.
*/
#define MCDS_MCXCCL15 (MCDS_MCX15_CCL)

/** \brief AF4, Counter Limit Register */
#define MCDS_MCX15_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010AF4u)
/** Alias (User Manual Name) for MCDS_MCX15_LMT.
* To use register names with standard convension, please use MCDS_MCX15_LMT.
*/
#define MCDS_MCXLMT15 (MCDS_MCX15_LMT)

/** \brief AF8, Current Count Register */
#define MCDS_MCX15_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010AF8u)
/** Alias (User Manual Name) for MCDS_MCX15_CNT.
* To use register names with standard convension, please use MCDS_MCX15_CNT.
*/
#define MCDS_MCXCNT15 (MCDS_MCX15_CNT)

/** \brief B00, Counter Control Register */
#define MCDS_MCX16_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B00u)
/** Alias (User Manual Name) for MCDS_MCX16_CCL.
* To use register names with standard convension, please use MCDS_MCX16_CCL.
*/
#define MCDS_MCXCCL16 (MCDS_MCX16_CCL)

/** \brief B04, Counter Limit Register */
#define MCDS_MCX16_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B04u)
/** Alias (User Manual Name) for MCDS_MCX16_LMT.
* To use register names with standard convension, please use MCDS_MCX16_LMT.
*/
#define MCDS_MCXLMT16 (MCDS_MCX16_LMT)

/** \brief B08, Current Count Register */
#define MCDS_MCX16_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B08u)
/** Alias (User Manual Name) for MCDS_MCX16_CNT.
* To use register names with standard convension, please use MCDS_MCX16_CNT.
*/
#define MCDS_MCXCNT16 (MCDS_MCX16_CNT)

/** \brief B10, Counter Control Register */
#define MCDS_MCX17_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B10u)
/** Alias (User Manual Name) for MCDS_MCX17_CCL.
* To use register names with standard convension, please use MCDS_MCX17_CCL.
*/
#define MCDS_MCXCCL17 (MCDS_MCX17_CCL)

/** \brief B14, Counter Limit Register */
#define MCDS_MCX17_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B14u)
/** Alias (User Manual Name) for MCDS_MCX17_LMT.
* To use register names with standard convension, please use MCDS_MCX17_LMT.
*/
#define MCDS_MCXLMT17 (MCDS_MCX17_LMT)

/** \brief B18, Current Count Register */
#define MCDS_MCX17_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B18u)
/** Alias (User Manual Name) for MCDS_MCX17_CNT.
* To use register names with standard convension, please use MCDS_MCX17_CNT.
*/
#define MCDS_MCXCNT17 (MCDS_MCX17_CNT)

/** \brief B20, Counter Control Register */
#define MCDS_MCX18_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B20u)
/** Alias (User Manual Name) for MCDS_MCX18_CCL.
* To use register names with standard convension, please use MCDS_MCX18_CCL.
*/
#define MCDS_MCXCCL18 (MCDS_MCX18_CCL)

/** \brief B24, Counter Limit Register */
#define MCDS_MCX18_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B24u)
/** Alias (User Manual Name) for MCDS_MCX18_LMT.
* To use register names with standard convension, please use MCDS_MCX18_LMT.
*/
#define MCDS_MCXLMT18 (MCDS_MCX18_LMT)

/** \brief B28, Current Count Register */
#define MCDS_MCX18_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B28u)
/** Alias (User Manual Name) for MCDS_MCX18_CNT.
* To use register names with standard convension, please use MCDS_MCX18_CNT.
*/
#define MCDS_MCXCNT18 (MCDS_MCX18_CNT)

/** \brief B30, Counter Control Register */
#define MCDS_MCX19_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CCL*)0xFA010B30u)
/** Alias (User Manual Name) for MCDS_MCX19_CCL.
* To use register names with standard convension, please use MCDS_MCX19_CCL.
*/
#define MCDS_MCXCCL19 (MCDS_MCX19_CCL)

/** \brief B34, Counter Limit Register */
#define MCDS_MCX19_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_LMT*)0xFA010B34u)
/** Alias (User Manual Name) for MCDS_MCX19_LMT.
* To use register names with standard convension, please use MCDS_MCX19_LMT.
*/
#define MCDS_MCXLMT19 (MCDS_MCX19_LMT)

/** \brief B38, Current Count Register */
#define MCDS_MCX19_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_MCX_CNT*)0xFA010B38u)
/** Alias (User Manual Name) for MCDS_MCX19_CNT.
* To use register names with standard convension, please use MCDS_MCX19_CNT.
*/
#define MCDS_MCXCNT19 (MCDS_MCX19_CNT)

