zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMcds_reg.h
/** \brief 2470, Comparator Bound Register 7 */
#define MCDS_TCXEA7_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_BND*)0xFA012470u)
/** Alias (User Manual Name) for MCDS_TCXEA7_BND.
* To use register names with standard convension, please use MCDS_TCXEA7_BND.
*/
#define MCDS_TCXEABND7 (MCDS_TCXEA7_BND)

/** \brief 2474, Comparator Range Register 7 */
#define MCDS_TCXEA7_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXEA_RNG*)0xFA012474u)
/** Alias (User Manual Name) for MCDS_TCXEA7_RNG.
* To use register names with standard convension, please use MCDS_TCXEA7_RNG.
*/
#define MCDS_TCXEARNG7 (MCDS_TCXEA7_RNG)

/** \brief 2480, Comparator Bound Register 0 */
#define MCDS_TCXWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xFA012480u)
/** Alias (User Manual Name) for MCDS_TCXWD0_BND.
* To use register names with standard convension, please use MCDS_TCXWD0_BND.
*/
#define MCDS_TCXWDBND0 (MCDS_TCXWD0_BND)

/** \brief 2484, Comparator Bound Register 0 */
#define MCDS_TCXWD0_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HBND*)0xFA012484u)
/** Alias (User Manual Name) for MCDS_TCXWD0_HBND.
* To use register names with standard convension, please use MCDS_TCXWD0_HBND.
*/
#define MCDS_TCXWDHBND0 (MCDS_TCXWD0_HBND)

/** \brief 2488, Comparator Range Register 0 */
#define MCDS_TCXWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xFA012488u)
/** Alias (User Manual Name) for MCDS_TCXWD0_RNG.
* To use register names with standard convension, please use MCDS_TCXWD0_RNG.
*/
#define MCDS_TCXWDRNG0 (MCDS_TCXWD0_RNG)

/** \brief 248C, Comparator Range Register 0 */
#define MCDS_TCXWD0_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HRNG*)0xFA01248Cu)
/** Alias (User Manual Name) for MCDS_TCXWD0_HRNG.
* To use register names with standard convension, please use MCDS_TCXWD0_HRNG.
*/
#define MCDS_TCXWDHRNG0 (MCDS_TCXWD0_HRNG)

/** \brief 2490, Comparator Mask Register 0 */
#define MCDS_TCXWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xFA012490u)
/** Alias (User Manual Name) for MCDS_TCXWD0_MSK.
* To use register names with standard convension, please use MCDS_TCXWD0_MSK.
*/
#define MCDS_TCXWDMSK0 (MCDS_TCXWD0_MSK)

/** \brief 2494, Comparator Mask Register 0 */
#define MCDS_TCXWD0_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HMSK*)0xFA012494u)
/** Alias (User Manual Name) for MCDS_TCXWD0_HMSK.
* To use register names with standard convension, please use MCDS_TCXWD0_HMSK.
*/
#define MCDS_TCXWDHMSK0 (MCDS_TCXWD0_HMSK)

/** \brief 249C, Comparator Sign Register 0 */
#define MCDS_TCXWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xFA01249Cu)
/** Alias (User Manual Name) for MCDS_TCXWD0_SGN.
* To use register names with standard convension, please use MCDS_TCXWD0_SGN.
*/
#define MCDS_TCXWDSGN0 (MCDS_TCXWD0_SGN)

/** \brief 24A0, Comparator Bound Register 1 */
#define MCDS_TCXWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xFA0124A0u)
/** Alias (User Manual Name) for MCDS_TCXWD1_BND.
* To use register names with standard convension, please use MCDS_TCXWD1_BND.
*/
#define MCDS_TCXWDBND1 (MCDS_TCXWD1_BND)

/** \brief 24A4, Comparator Bound Register 1 */
#define MCDS_TCXWD1_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HBND*)0xFA0124A4u)
/** Alias (User Manual Name) for MCDS_TCXWD1_HBND.
* To use register names with standard convension, please use MCDS_TCXWD1_HBND.
*/
#define MCDS_TCXWDHBND1 (MCDS_TCXWD1_HBND)

/** \brief 24A8, Comparator Range Register 1 */
#define MCDS_TCXWD1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xFA0124A8u)
/** Alias (User Manual Name) for MCDS_TCXWD1_RNG.
* To use register names with standard convension, please use MCDS_TCXWD1_RNG.
*/
#define MCDS_TCXWDRNG1 (MCDS_TCXWD1_RNG)

/** \brief 24AC, Comparator Range Register 1 */
#define MCDS_TCXWD1_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HRNG*)0xFA0124ACu)
/** Alias (User Manual Name) for MCDS_TCXWD1_HRNG.
* To use register names with standard convension, please use MCDS_TCXWD1_HRNG.
*/
#define MCDS_TCXWDHRNG1 (MCDS_TCXWD1_HRNG)

/** \brief 24B0, Comparator Mask Register 1 */
#define MCDS_TCXWD1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xFA0124B0u)
/** Alias (User Manual Name) for MCDS_TCXWD1_MSK.
* To use register names with standard convension, please use MCDS_TCXWD1_MSK.
*/
#define MCDS_TCXWDMSK1 (MCDS_TCXWD1_MSK)

/** \brief 24B4, Comparator Mask Register 1 */
#define MCDS_TCXWD1_HMSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HMSK*)0xFA0124B4u)
/** Alias (User Manual Name) for MCDS_TCXWD1_HMSK.
* To use register names with standard convension, please use MCDS_TCXWD1_HMSK.
*/
#define MCDS_TCXWDHMSK1 (MCDS_TCXWD1_HMSK)

/** \brief 24BC, Comparator Sign Register 1 */
#define MCDS_TCXWD1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_SGN*)0xFA0124BCu)
/** Alias (User Manual Name) for MCDS_TCXWD1_SGN.
* To use register names with standard convension, please use MCDS_TCXWD1_SGN.
*/
#define MCDS_TCXWDSGN1 (MCDS_TCXWD1_SGN)

/** \brief 24C0, Comparator Bound Register 2 */
#define MCDS_TCXWD2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_BND*)0xFA0124C0u)
/** Alias (User Manual Name) for MCDS_TCXWD2_BND.
* To use register names with standard convension, please use MCDS_TCXWD2_BND.
*/
#define MCDS_TCXWDBND2 (MCDS_TCXWD2_BND)

/** \brief 24C4, Comparator Bound Register 2 */
#define MCDS_TCXWD2_HBND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HBND*)0xFA0124C4u)
/** Alias (User Manual Name) for MCDS_TCXWD2_HBND.
* To use register names with standard convension, please use MCDS_TCXWD2_HBND.
*/
#define MCDS_TCXWDHBND2 (MCDS_TCXWD2_HBND)

/** \brief 24C8, Comparator Range Register 2 */
#define MCDS_TCXWD2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_RNG*)0xFA0124C8u)
/** Alias (User Manual Name) for MCDS_TCXWD2_RNG.
* To use register names with standard convension, please use MCDS_TCXWD2_RNG.
*/
#define MCDS_TCXWDRNG2 (MCDS_TCXWD2_RNG)

/** \brief 24CC, Comparator Range Register 2 */
#define MCDS_TCXWD2_HRNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_HRNG*)0xFA0124CCu)
/** Alias (User Manual Name) for MCDS_TCXWD2_HRNG.
* To use register names with standard convension, please use MCDS_TCXWD2_HRNG.
*/
#define MCDS_TCXWDHRNG2 (MCDS_TCXWD2_HRNG)

/** \brief 24D0, Comparator Mask Register 2 */
#define MCDS_TCXWD2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXWD_MSK*)0xFA0124D0u)
/** Alias (User Manual Name) for MCDS_TCXWD2_MSK.
* To use register names with standard convension, please use MCDS_TCXWD2_MSK.
*/
#define MCDS_TCXWDMSK2 (MCDS_TCXWD2_MSK)

