zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMcds_reg.h
/** \brief 2C1C, Comparator Sign Register 1 */
#define MCDS_TCXID1_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXID_SGN*)0xFA012C1Cu)
/** Alias (User Manual Name) for MCDS_TCXID1_SGN.
* To use register names with standard convension, please use MCDS_TCXID1_SGN.
*/
#define MCDS_TCXIDSGN1 (MCDS_TCXID1_SGN)

/** \brief 3000, Comparator Bound Register 0 */
#define MCDS_TCXIP0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013000u)
/** Alias (User Manual Name) for MCDS_TCXIP0_BND.
* To use register names with standard convension, please use MCDS_TCXIP0_BND.
*/
#define MCDS_TCXIPBND0 (MCDS_TCXIP0_BND)

/** \brief 3004, Comparator Range Register 0 */
#define MCDS_TCXIP0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013004u)
/** Alias (User Manual Name) for MCDS_TCXIP0_RNG.
* To use register names with standard convension, please use MCDS_TCXIP0_RNG.
*/
#define MCDS_TCXIPRNG0 (MCDS_TCXIP0_RNG)

/** \brief 3010, Comparator Bound Register 1 */
#define MCDS_TCXIP1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013010u)
/** Alias (User Manual Name) for MCDS_TCXIP1_BND.
* To use register names with standard convension, please use MCDS_TCXIP1_BND.
*/
#define MCDS_TCXIPBND1 (MCDS_TCXIP1_BND)

/** \brief 3014, Comparator Range Register 1 */
#define MCDS_TCXIP1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013014u)
/** Alias (User Manual Name) for MCDS_TCXIP1_RNG.
* To use register names with standard convension, please use MCDS_TCXIP1_RNG.
*/
#define MCDS_TCXIPRNG1 (MCDS_TCXIP1_RNG)

/** \brief 3020, Comparator Bound Register 2 */
#define MCDS_TCXIP2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013020u)
/** Alias (User Manual Name) for MCDS_TCXIP2_BND.
* To use register names with standard convension, please use MCDS_TCXIP2_BND.
*/
#define MCDS_TCXIPBND2 (MCDS_TCXIP2_BND)

/** \brief 3024, Comparator Range Register 2 */
#define MCDS_TCXIP2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013024u)
/** Alias (User Manual Name) for MCDS_TCXIP2_RNG.
* To use register names with standard convension, please use MCDS_TCXIP2_RNG.
*/
#define MCDS_TCXIPRNG2 (MCDS_TCXIP2_RNG)

/** \brief 3030, Comparator Bound Register 3 */
#define MCDS_TCXIP3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013030u)
/** Alias (User Manual Name) for MCDS_TCXIP3_BND.
* To use register names with standard convension, please use MCDS_TCXIP3_BND.
*/
#define MCDS_TCXIPBND3 (MCDS_TCXIP3_BND)

/** \brief 3034, Comparator Range Register 3 */
#define MCDS_TCXIP3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013034u)
/** Alias (User Manual Name) for MCDS_TCXIP3_RNG.
* To use register names with standard convension, please use MCDS_TCXIP3_RNG.
*/
#define MCDS_TCXIPRNG3 (MCDS_TCXIP3_RNG)

/** \brief 3040, Comparator Bound Register 4 */
#define MCDS_TCXIP4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013040u)
/** Alias (User Manual Name) for MCDS_TCXIP4_BND.
* To use register names with standard convension, please use MCDS_TCXIP4_BND.
*/
#define MCDS_TCXIPBND4 (MCDS_TCXIP4_BND)

/** \brief 3044, Comparator Range Register 4 */
#define MCDS_TCXIP4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013044u)
/** Alias (User Manual Name) for MCDS_TCXIP4_RNG.
* To use register names with standard convension, please use MCDS_TCXIP4_RNG.
*/
#define MCDS_TCXIPRNG4 (MCDS_TCXIP4_RNG)

/** \brief 3050, Comparator Bound Register 5 */
#define MCDS_TCXIP5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_BND*)0xFA013050u)
/** Alias (User Manual Name) for MCDS_TCXIP5_BND.
* To use register names with standard convension, please use MCDS_TCXIP5_BND.
*/
#define MCDS_TCXIPBND5 (MCDS_TCXIP5_BND)

/** \brief 3054, Comparator Range Register 5 */
#define MCDS_TCXIP5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCXIP_RNG*)0xFA013054u)
/** Alias (User Manual Name) for MCDS_TCXIP5_RNG.
* To use register names with standard convension, please use MCDS_TCXIP5_RNG.
*/
#define MCDS_TCXIPRNG5 (MCDS_TCXIP5_RNG)

/** \brief 4000, Debug Status Register */
#define MCDS_TCYDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYDCSTS*)0xFA014000u)

/** \brief 4004, Current Process ID */
#define MCDS_TCYCID /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYCID*)0xFA014004u)

/** \brief 4008, Current Instruction Pointer */
#define MCDS_TCYCIP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYCIP*)0xFA014008u)

/** \brief 400C, Compact Function Trace Register */
#define MCDS_TCYCFT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYCFT*)0xFA01400Cu)

/** \brief 4200, Lookup Table Data Register */
#define MCDS_TCYPALLUTD /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPALLUTD*)0xFA014200u)

/** \brief 4204, Lookup Table Address Register */
#define MCDS_TCYPALLUTA /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPALLUTA*)0xFA014204u)

/** \brief 4210, Lookup Table Base Register */
#define MCDS_TCYPAL0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_BND*)0xFA014210u)
/** Alias (User Manual Name) for MCDS_TCYPAL0_BND.
* To use register names with standard convension, please use MCDS_TCYPAL0_BND.
*/
#define MCDS_TCYPALBND0 (MCDS_TCYPAL0_BND)

/** \brief 4214, Lookup Table Range Register */
#define MCDS_TCYPAL0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_RNG*)0xFA014214u)
/** Alias (User Manual Name) for MCDS_TCYPAL0_RNG.
* To use register names with standard convension, please use MCDS_TCYPAL0_RNG.
*/
#define MCDS_TCYPALRNG0 (MCDS_TCYPAL0_RNG)

/** \brief 4218, Lookup Table Mapping Register */
#define MCDS_TCYPAL0_MAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_MAP*)0xFA014218u)
/** Alias (User Manual Name) for MCDS_TCYPAL0_MAP.
* To use register names with standard convension, please use MCDS_TCYPAL0_MAP.
*/
#define MCDS_TCYPALMAP0 (MCDS_TCYPAL0_MAP)

/** \brief 4220, Lookup Table Base Register */
#define MCDS_TCYPAL1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_BND*)0xFA014220u)
/** Alias (User Manual Name) for MCDS_TCYPAL1_BND.
* To use register names with standard convension, please use MCDS_TCYPAL1_BND.
*/
#define MCDS_TCYPALBND1 (MCDS_TCYPAL1_BND)

/** \brief 4224, Lookup Table Range Register */
#define MCDS_TCYPAL1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYPAL_RNG*)0xFA014224u)
/** Alias (User Manual Name) for MCDS_TCYPAL1_RNG.
* To use register names with standard convension, please use MCDS_TCYPAL1_RNG.
*/
#define MCDS_TCYPALRNG1 (MCDS_TCYPAL1_RNG)

