zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxMcds_reg.h
/** \brief 5000, Comparator Bound Register 0 */
#define MCDS_TCYIP0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015000u)
/** Alias (User Manual Name) for MCDS_TCYIP0_BND.
* To use register names with standard convension, please use MCDS_TCYIP0_BND.
*/
#define MCDS_TCYIPBND0 (MCDS_TCYIP0_BND)

/** \brief 5004, Comparator Range Register 0 */
#define MCDS_TCYIP0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015004u)
/** Alias (User Manual Name) for MCDS_TCYIP0_RNG.
* To use register names with standard convension, please use MCDS_TCYIP0_RNG.
*/
#define MCDS_TCYIPRNG0 (MCDS_TCYIP0_RNG)

/** \brief 5010, Comparator Bound Register 1 */
#define MCDS_TCYIP1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015010u)
/** Alias (User Manual Name) for MCDS_TCYIP1_BND.
* To use register names with standard convension, please use MCDS_TCYIP1_BND.
*/
#define MCDS_TCYIPBND1 (MCDS_TCYIP1_BND)

/** \brief 5014, Comparator Range Register 1 */
#define MCDS_TCYIP1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015014u)
/** Alias (User Manual Name) for MCDS_TCYIP1_RNG.
* To use register names with standard convension, please use MCDS_TCYIP1_RNG.
*/
#define MCDS_TCYIPRNG1 (MCDS_TCYIP1_RNG)

/** \brief 5020, Comparator Bound Register 2 */
#define MCDS_TCYIP2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015020u)
/** Alias (User Manual Name) for MCDS_TCYIP2_BND.
* To use register names with standard convension, please use MCDS_TCYIP2_BND.
*/
#define MCDS_TCYIPBND2 (MCDS_TCYIP2_BND)

/** \brief 5024, Comparator Range Register 2 */
#define MCDS_TCYIP2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015024u)
/** Alias (User Manual Name) for MCDS_TCYIP2_RNG.
* To use register names with standard convension, please use MCDS_TCYIP2_RNG.
*/
#define MCDS_TCYIPRNG2 (MCDS_TCYIP2_RNG)

/** \brief 5030, Comparator Bound Register 3 */
#define MCDS_TCYIP3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015030u)
/** Alias (User Manual Name) for MCDS_TCYIP3_BND.
* To use register names with standard convension, please use MCDS_TCYIP3_BND.
*/
#define MCDS_TCYIPBND3 (MCDS_TCYIP3_BND)

/** \brief 5034, Comparator Range Register 3 */
#define MCDS_TCYIP3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015034u)
/** Alias (User Manual Name) for MCDS_TCYIP3_RNG.
* To use register names with standard convension, please use MCDS_TCYIP3_RNG.
*/
#define MCDS_TCYIPRNG3 (MCDS_TCYIP3_RNG)

/** \brief 5040, Comparator Bound Register 4 */
#define MCDS_TCYIP4_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015040u)
/** Alias (User Manual Name) for MCDS_TCYIP4_BND.
* To use register names with standard convension, please use MCDS_TCYIP4_BND.
*/
#define MCDS_TCYIPBND4 (MCDS_TCYIP4_BND)

/** \brief 5044, Comparator Range Register 4 */
#define MCDS_TCYIP4_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015044u)
/** Alias (User Manual Name) for MCDS_TCYIP4_RNG.
* To use register names with standard convension, please use MCDS_TCYIP4_RNG.
*/
#define MCDS_TCYIPRNG4 (MCDS_TCYIP4_RNG)

/** \brief 5050, Comparator Bound Register 5 */
#define MCDS_TCYIP5_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_BND*)0xFA015050u)
/** Alias (User Manual Name) for MCDS_TCYIP5_BND.
* To use register names with standard convension, please use MCDS_TCYIP5_BND.
*/
#define MCDS_TCYIPBND5 (MCDS_TCYIP5_BND)

/** \brief 5054, Comparator Range Register 5 */
#define MCDS_TCYIP5_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_TCYIP_RNG*)0xFA015054u)
/** Alias (User Manual Name) for MCDS_TCYIP5_RNG.
* To use register names with standard convension, please use MCDS_TCYIP5_RNG.
*/
#define MCDS_TCYIPRNG5 (MCDS_TCYIP5_RNG)

/** \brief 6000, Debug Status Register */
#define MCDS_SPBDCSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBDCSTS*)0xFA016000u)

/** \brief 6400, Comparator Bound Register 0 */
#define MCDS_SPBEA0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_BND*)0xFA016400u)
/** Alias (User Manual Name) for MCDS_SPBEA0_BND.
* To use register names with standard convension, please use MCDS_SPBEA0_BND.
*/
#define MCDS_SPBEABND0 (MCDS_SPBEA0_BND)

/** \brief 6404, Comparator Range Register 0 */
#define MCDS_SPBEA0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_RNG*)0xFA016404u)
/** Alias (User Manual Name) for MCDS_SPBEA0_RNG.
* To use register names with standard convension, please use MCDS_SPBEA0_RNG.
*/
#define MCDS_SPBEARNG0 (MCDS_SPBEA0_RNG)

/** \brief 6410, Comparator Bound Register 1 */
#define MCDS_SPBEA1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_BND*)0xFA016410u)
/** Alias (User Manual Name) for MCDS_SPBEA1_BND.
* To use register names with standard convension, please use MCDS_SPBEA1_BND.
*/
#define MCDS_SPBEABND1 (MCDS_SPBEA1_BND)

/** \brief 6414, Comparator Range Register 1 */
#define MCDS_SPBEA1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_RNG*)0xFA016414u)
/** Alias (User Manual Name) for MCDS_SPBEA1_RNG.
* To use register names with standard convension, please use MCDS_SPBEA1_RNG.
*/
#define MCDS_SPBEARNG1 (MCDS_SPBEA1_RNG)

/** \brief 6420, Comparator Bound Register 2 */
#define MCDS_SPBEA2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_BND*)0xFA016420u)
/** Alias (User Manual Name) for MCDS_SPBEA2_BND.
* To use register names with standard convension, please use MCDS_SPBEA2_BND.
*/
#define MCDS_SPBEABND2 (MCDS_SPBEA2_BND)

/** \brief 6424, Comparator Range Register 2 */
#define MCDS_SPBEA2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_RNG*)0xFA016424u)
/** Alias (User Manual Name) for MCDS_SPBEA2_RNG.
* To use register names with standard convension, please use MCDS_SPBEA2_RNG.
*/
#define MCDS_SPBEARNG2 (MCDS_SPBEA2_RNG)

/** \brief 6430, Comparator Bound Register 3 */
#define MCDS_SPBEA3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_BND*)0xFA016430u)
/** Alias (User Manual Name) for MCDS_SPBEA3_BND.
* To use register names with standard convension, please use MCDS_SPBEA3_BND.
*/
#define MCDS_SPBEABND3 (MCDS_SPBEA3_BND)

/** \brief 6434, Comparator Range Register 3 */
#define MCDS_SPBEA3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBEA_RNG*)0xFA016434u)
/** Alias (User Manual Name) for MCDS_SPBEA3_RNG.
* To use register names with standard convension, please use MCDS_SPBEA3_RNG.
*/
#define MCDS_SPBEARNG3 (MCDS_SPBEA3_RNG)

/** \brief 6480, Comparator Bound Register 0 */
#define MCDS_SPBWD0_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_BND*)0xFA016480u)
/** Alias (User Manual Name) for MCDS_SPBWD0_BND.
* To use register names with standard convension, please use MCDS_SPBWD0_BND.
*/
#define MCDS_SPBWDBND0 (MCDS_SPBWD0_BND)

/** \brief 6484, Comparator Range Register 0 */
#define MCDS_SPBWD0_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_RNG*)0xFA016484u)
/** Alias (User Manual Name) for MCDS_SPBWD0_RNG.
* To use register names with standard convension, please use MCDS_SPBWD0_RNG.
*/
#define MCDS_SPBWDRNG0 (MCDS_SPBWD0_RNG)

/** \brief 6488, Comparator Mask Register 0 */
#define MCDS_SPBWD0_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_MSK*)0xFA016488u)
/** Alias (User Manual Name) for MCDS_SPBWD0_MSK.
* To use register names with standard convension, please use MCDS_SPBWD0_MSK.
*/
#define MCDS_SPBWDMSK0 (MCDS_SPBWD0_MSK)

/** \brief 648C, Comparator Sign Register 0 */
#define MCDS_SPBWD0_SGN /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_SGN*)0xFA01648Cu)
/** Alias (User Manual Name) for MCDS_SPBWD0_SGN.
* To use register names with standard convension, please use MCDS_SPBWD0_SGN.
*/
#define MCDS_SPBWDSGN0 (MCDS_SPBWD0_SGN)

/** \brief 6490, Comparator Bound Register 1 */
#define MCDS_SPBWD1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDS_SPBWD_BND*)0xFA016490u)
/** Alias (User Manual Name) for MCDS_SPBWD1_BND.
* To use register names with standard convension, please use MCDS_SPBWD1_BND.
*/
#define MCDS_SPBWDBND1 (MCDS_SPBWD1_BND)

